var result = 'number' + 3 + 3;
console.log(result); // result 'number33' - дії виконуються зліва направо і відбувається конкатенація, оскільки є рядок.

var result1 = null + 3;
console.log(result1); // result 3 - null перетворюється на 0 (коли відбуваються математичні операції з числами), тому 0+3=3.

var result2 = 5 && "qwerty";
console.log(result2); // result "qwerty" - в даному випадку наявний оператор &&, і він повертає перший false. В даному випадку 5 - це true, тому результат буде "qwerty"

var result3 = +'40' + +'2' + "hillel";
console.log(result3); // result "42hillel" - перед '40' та '2' стоять унарні плюси, які перетворюють '40' та '2' на числа. Тобто, дії знова виконуються зліва направа, маємо вже число 42 і додаємо рядок "hillel", відбувається конкатенація.

var result4 = '10' - 5 === 6;
console.log(result4); // result false - в даному випадку відбувається віднімання і '10' стає числом. Тобто 10-5=5. Після чого відбувається порівняння 5 === 6, і оскількі 5 менше 6, то результат буде false. 

var result5 = true + false;
console.log(result5); // result 1 - в даному випадку використовується булеве значення та математичний оператор і булеве значення стає числом. Відповідно true=1, а false=0.

var result6 = '4px' - 3;
console.log(result6); // result Nan - в даному випадку математичий оператор намагається перетворити рядок на число, але в цьому рядку є літери, через що він не може рядок перетворити у число і не відбувається подальша математична операція, оскільки отримуємо результат NaN.

var result7 = '4' - 3;
console.log(result7); // result 1 -  в даному випадку рядок не містить літер, тому математичний оператор перетворює рядок на число і в результаті маємо 4-3=1.

var result8 = '6' + 3 ** 0;
console.log(result8); // result "61" - в даному випадку оператор ** має вищий пріоритет, тому ми рахуємо 3 в 0й степені, що дорівнює 1. І далі виконується конкатенація рядка '6' та числа 1.

var result9 = 12 / '6';
console.log(result9); // result 2 - в даному випадку математичний оператор перетворює рядок '6' на число 6. Тому робимо звичайне ділення 12/6=2.

var result10 = '10' + (5 === 6);
console.log(result10); // result "10false" - в даному випадку першим робимо дії у дужках, порівнюємо 5 та 6 і отримуємо false. Після відбувається конкатенація рядка '10' та булевого значення false.

var result11 = null == '';
console.log(result11); //  result false - в даному випадку ми маємо нестроге порівняння, при якому null = або null, або undefined. А також маємо пустий рядок, який прирівнюється до 0. А оскільки null не перетворюється на число, то виходить, що null == 0 дає результат false. 

var result12 = 3 ** (9 / 3);
console.log(result12); // result 27 - в даному випадку виконуємо дії в дужках,тобто ділимо 9 на 3 та отримуємо 3. А далі виконується оператор ** і вираховуємо скільки буде 3 в 3й степені.

var result13 = !!'false' == !!'true';
console.log(result13); // result true - в даному випадку ми маємо не пустий рядок, який вже є true. Далі в нас виконується подвійне заперечення, тобто маємо true робимо одне заперечення (отримуємо false) і робимо друге заперечення (отримуємо true). Тому у нас виходить true == true, що також є true.

var result14 = 0 || '0' && 1;
console.log(result14); // result 1 - в даному випадку у оператора && пріоритет буде вищий, тому спочатку виконуємо '0' && 1 і отримуємо 1 (оскільки оператор && повертає останнє значення, оскільки всі значення істинні). І потім виконуємо 0 || 1, що дає 1 (оскільки оператор || повертає перге істинне значення, а 0 = false).

var result15 = (+null == false) < 1;
console.log(result15); // result false - в даному випадку першими виконуються дужки, де перед null стоїть унарний плюс, що перетворює null на 0. Далі йде нестроге порівняння 0 == false і це true (оскільки false стає також 0). І далі виконуємо порівняння true < 1, при якому булеве значення true стає числом 1. Тому порівнюємо 1 < 1, що дає false.

var result16 = false && true || true;
console.log(result16); // result true - в даному випадку знову оператор && має виший пріоритет, тому спочатку виконуємо його - false && true дає false (оскільки в даному випадку є значення false та true, то опертор повертає перший false). Потім виконуємо false || true, що дає true (оскільки оператор || повертає перше істинне значення).

var result17 = false && (false || true);
console.log(result17); // result false - в даному випадку першим виконуються дужки, в дужках у нас опертор ||, який повертає перше істинне значення. Тобто false || true = true. Потім виконуємо false && true і отримуємо false, оскільки опертор && повертає перше значення false. 

var result18 = (+null == false) < 1 ** 5;
console.log(result18); // result false - в даному випадку першими виконуються дужки, перед null стоїть унарний плюс, який перетворює null на 0. Тому маємо 0 == false, а оскільки це нестроге порівнння false також стає числом 0. Тобто 0 == 0 = true. Після чого виконується опертор **, відносимо 1 в 5й степені і отримуємо 1. Далі виконуємо порівняння true < 1, при якому булеве значення true стає числом 1. Тому порівнюємо 1 < 1, що дає false.










